uhnp/src/InformationRegisters/СвязанныеДоговоры/СвязанныеДоговоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеДоговоры</name>
  <resources>
    <name>ВидСвязи</name>
    <type>
      <types>CatalogRef.ВидыСвязейОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>БазовыйДоговор</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДоговор</name>
    <type>
      <types>DefinedType.ДоговорОбеспечениеТретьихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СвязанныеДоговоры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьБазовыеДоговоры(СвязанныйДоговор, ВидСвязи = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СвязанныеДоговоры.БазовыйДоговор,
	|	СвязанныеДоговоры.ВидСвязи
	|ИЗ
	|	РегистрСведений.СвязанныеДоговоры КАК СвязанныеДоговоры
	|ГДЕ
	|	СвязанныеДоговоры.СвязанныйДоговор В(&СвязанныйДоговор)
	|	И ВЫБОР
	|			КОГДА &УстановленВидСвязи
	|				ТОГДА СвязанныеДоговоры.ВидСвязи В (&ВидСвязи)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("СвязанныйДоговор", 	СвязанныйДоговор);
	Запрос.УстановитьПараметр("УстановленВидСвязи", ВидСвязи <> Неопределено);
	Запрос.УстановитьПараметр("ВидСвязи", 			ВидСвязи);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСвязанныеДоговоры(БазовыйДоговор, ВидСвязи = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СвязанныеДоговоры.СвязанныйДоговор,
	|	СвязанныеДоговоры.ВидСвязи
	|ИЗ
	|	РегистрСведений.СвязанныеДоговоры КАК СвязанныеДоговоры
	|ГДЕ
	|	СвязанныеДоговоры.БазовыйДоговор В(&БазовыйДоговор)
	|	И ВЫБОР
	|			КОГДА &УстановленВидСвязи
	|				ТОГДА СвязанныеДоговоры.ВидСвязи В (&ВидСвязи)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("БазовыйДоговор", 	БазовыйДоговор);
	Запрос.УстановитьПараметр("УстановленВидСвязи", ВидСвязи <> Неопределено);
	Запрос.УстановитьПараметр("ВидСвязи", 			ВидСвязи);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьВстречныйДоговор(БазовыйДоговор) Экспорт

	ВстречныеДоговоры = РегистрыСведений.СвязанныеДоговоры.ПолучитьСвязанныеДоговоры(БазовыйДоговор, Справочники.ВидыСвязейОбъектов.ПолучитьВнутригрупповыеВидыСвязейДоговоров());
	
	Возврат ?(ВстречныеДоговоры.Количество(), ВстречныеДоговоры[0].СвязанныйДоговор, Неопределено);
	
КонецФункции

Процедура ЗаписатьВстречныеДоговоры(Договор, ВстречныйДоговор, Отказ = Ложь) Экспорт	
	
	ВидСвязи = Справочники.ВидыСвязейОбъектов.ВнутригрупповойДоговор;
	
	// Проверим, первая ли это запись;
	СвязанныеДоговоры = ПолучитьСвязанныеДоговоры(Договор, ВидСвязи);
	ЭтоПерваяЗапись = Не ЗначениеЗаполнено(СвязанныеДоговоры);
	
	ЗаписатьСвязанныеДоговоры(Договор, ВстречныйДоговор, ВидСвязи, Отказ);
	ЗаписатьСвязанныеДоговоры(ВстречныйДоговор, Договор, ВидСвязи, Отказ);
	
	Если Не Отказ тогда
		СвязанныеДоговорыУХПереопределяемый.ПриЗаписиВстречныхДоговоров(
			Договор,
			ВстречныйДоговор,
			ЭтоПерваяЗапись);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьСвязанныеДоговоры(БазовыйДоговор, СвязанныйДоговор, ВидСвязи, Отказ = Ложь) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	нз = СоздатьНаборЗаписей();
	
	нз.Отбор.БазовыйДоговор.Установить(БазовыйДоговор);
	нз.Отбор.СвязанныйДоговор.Установить(СвязанныйДоговор);
	
	Запись = нз.Добавить();
	Запись.БазовыйДоговор = БазовыйДоговор;
	Запись.СвязанныйДоговор = СвязанныйДоговор;
	Запись.ВидСвязи = ВидСвязи;
		
	Попытка
	    нз.Записать();	
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось записать информацию по связанным договорам'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);	    
	КонецПопытки;

КонецПроцедуры

Процедура УдалитьВстречныеДоговоры(Договор, Отказ = Ложь) Экспорт	
	
	ВидСвязи = Справочники.ВидыСвязейОбъектов.ВнутригрупповойДоговор;
	
	Встречные = Новый Массив;
	Выборка = РегистрыСведений.СвязанныеДоговоры.Выбрать(Новый Структура("БазовыйДоговор", Договор));
	Пока Выборка.Следующий() Цикл
		Если (Выборка.ВидСвязи = ВидСвязи) Тогда
			Встречные.Добавить(Выборка.СвязанныйДоговор);	
		КонецЕсли;		
	КонецЦикла;
	
	Выборка = РегистрыСведений.СвязанныеДоговоры.Выбрать(Новый Структура("СвязанныйДоговор", Договор));
	Пока Выборка.Следующий() Цикл
		Если (Выборка.ВидСвязи = ВидСвязи) Тогда
			Встречные.Добавить(Выборка.БазовыйДоговор);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ВстречныйДоговор Из Встречные Цикл
		
		УдалитьСвязанныеДоговоры(Договор, ВстречныйДоговор, Отказ);
		УдалитьСвязанныеДоговоры(ВстречныйДоговор, Договор, Отказ);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСвязанныеДоговоры(БазовыйДоговор, СвязанныйДоговор, Отказ = Ложь) Экспорт

	нз = СоздатьНаборЗаписей();
	
	нз.Отбор.БазовыйДоговор.Установить(БазовыйДоговор);
	нз.Отбор.СвязанныйДоговор.Установить(СвязанныйДоговор);
	
	нз.Очистить();	
	
	Попытка
	    нз.Записать();	
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось записать информацию по связанным договорам по причине: '");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки + ОписаниеОшибки(),,,, Отказ);	    
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
	
#КонецЕсли
